GITBOOK-41: add: Agent Guard doc, revamp: Agentic Proxies Docs
